app/controllers/burgers_controller.rb

  def index
    @burgers = Burger.all
---
SELECT "burgers".* FROM "burgers"

  def create
    @burger = Burger.new(burger_params)

    respond_to do |format|
      if @burger.save
---
INSERT INTO "burgers" ("name", "price", "image", "nutriscore", "created_at", "updated_at", "code") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "burger"], ["price", 10.0], ["image", "0"], ["nutriscore", "A"], ["created_at", "2020-03-07 11:02:04.195777"], ["updated_at", "2020-03-07 11:02:04.195777"], ["code", "2"]]

  def update
    respond_to do |format|
      if @burger.update(burger_params)
---
UPDATE "burgers" SET "nutriscore" = ?, "updated_at" = ? WHERE "burgers"."id" = ?  [["nutriscore", "5"], ["updated_at", "2020-02-29 14:44:20.916880"], ["id", 1]]

  def destroy
    @burger.destroy
---
DELETE FROM "burgers" WHERE "burgers"."id" = ?  [["id", 1]]

    def set_burger
      @burger = Burger.find(params[:id])
---
SELECT "burgers".* FROM "burgers" WHERE "burgers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]